Tekla Open API Reference for Tekla Structures 2025
Phase Constructor (Int32, String, String, Int32)
 Instantiates a new phase with the given parameters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Phase(
	int PhaseNumber,
	string PhaseName,
	string PhaseComment,
	int IsCurrentPhase
)
Public Sub New (
	PhaseNumber As Integer,
	PhaseName As String,
	PhaseComment As String,
	IsCurrentPhase As Integer
)
Parameters
PhaseNumber
Type: System.Int32
The number of the phase.
PhaseName
Type: System.String
The name of the phase.
PhaseComment
Type: System.String
The comment of the phase.
IsCurrentPhase
Type: System.Int32
The value is 1 if the phase is the current phase, 0 otherwise.
See Also
Reference
Phase Class
Phase Overload
Tekla.Structures.Model Namespace